<script setup>
import LiRouter from '@/components/LiRouter.vue';
import { useHead, useSeoMeta } from '@unhead/vue';

useSeoMeta({
  title: ' شرح كيفية استخدام موقع حاسبة التاريخ والوقت',
  description: "شرح كيفية استخدام موقع حاسبة التاريخ والوقت والأدوات التي يوفرها وأنظمة التقويم التي يدعمها"
})

useHead({
  link: [
    { rel: 'canonical', href: 'https://datetimecalcar.netlify.app/explain-datetime-calculator-ar' }
  ]
})

const allTools=[
    [
        '/date-difference',
        'حاسبة الفرق بين تاريخين:',
        ' في هذه الصفحة يمكنك إدخال تاريخين لمعرفة الزمن الذي يفصل بينهما بأربع صيغ ، بالسنوات وبالشهور وبالأسابيع وبالأيام'
    ],
    [
        '/time-difference',
        'حاسبة الفرق بين وقتين:',
        ' يتم فيها إدخال وقتين الفرق بينهما أقل من 24 ساعة ليتم حساب الزمن الذي يفصل بينهما بثلاث صيغ، بالساعات وبالدقائق وبالثواني، يشترط هنا أن يتم إدخال الوقت الأسبق أولاً حيث إن كان الثاني أسبق من الأول سيتم افتراض أن الوقت الثاني موجود في اليوم التالي ليوم الوقت الأول'
    ],
    [
        '/date-converter',
        'محول التاريخ:',
        ' يتم فيه إدخال التاريخ بإحدى الأنظمة الثلاث المدعومة في الموقع (الميلادي الغريغوري، اليولياني، الهجري بحساب أم القرى الرسمي) فيتم تحويل التاريخ إلى النظامين الآخرين وعرض يوم الأسبوع لهذا التاريخ (السبت، الأحد، ...)'
    ],
    [
        '/calendar',
        'رزنامة الشهر:',
        ' يتم فيها إدخال شهر ما ليتم عرض أرقام أيام الشهر في شبكة توضح يوم الأسبوع لكل يوم من الشهر'
    ],
    [
        '/date-calculator',
        'حاسبة التاريخ:',
        ' يتم فيها إدخال تاريخ محدد وعدد معين من السنوات والشهور والأيام وتحديد إن كنت تريد حساب تاريخ قبل أم بعد التاريخ المدخل فيتم عرض التاريخ الذي يسبق أو يلي التاريخ المدخل بمقدار القيمة المدخلة للفارق الزمني'
    ],
    [
        '/time-calculator',
        'حاسبة الوقت:',
        ' يتم فيها إدخال تاريخ ووقت محددان وإدخال فترة زمنية بالساعات والدقائق والثواني وتحديد إن كنت  تريد حساب الوقت قبل أم بعد الوقت المدخل فيتم عرض التاريخ والوقت قبل أو بعد الوقت المدخل بمقدار القيمة المدخلة للفارق الزمني'
    ]
]
</script>

<template>
    <div>
      هل تريد حساب عمرك بالسنة والشهر واليوم؟ أو هل تريد التحويل بين التاريخين الهجري والميلادي؟ أو هل تريد معرفة كم سيكون التاريخ بعد عدد محدد من الأيام؟
    </div>
    <div>
      موقع حاسبة التاريخ والوقت يقدم أدوات تقوم بذلك وأكثر، رابط الصفحة الرئيسية للموقع:
    </div>
    <div style="direction:ltr">
      <RouterLink to="/"> https://datetimecalcar.netlify.app/ </RouterLink>
    </div>
    <div>
        <p>
        الأدوات المتوفرة في الموقع:
      </p>
      <ul>
        <LiRouter v-for="tool in allTools" :the-link="tool[0]" :the-title="tool[1]" >
            {{  tool[2]  }}
        </LiRouter>
      </ul>
    </div>
</template>

<style scoped></style>